nectar.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Nectar: A Honeychecker implementation</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Nectar: A Honeychecker implementation"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-05-12T16:40-0500"/>
<meta name="author" content="Aaron Bedra"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Nectar: A Honeychecker implementation</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Introduction</a></li>
<li><a href="#sec-2">2 Project definition and dependencies</a></li>
<li><a href="#sec-3">3 Implementation</a>
<ul>
<li><a href="#sec-3-1">3.1 Loading resources</a></li>
<li><a href="#sec-3-2">3.2 Setting up the Redis connection</a></li>
<li><a href="#sec-3-3">3.3 The add function</a></li>
<li><a href="#sec-3-4">3.4 The check function</a></li>
<li><a href="#sec-3-5">3.5 Defining the application routes</a></li>
<li><a href="#sec-3-6">3.6 Defining the application</a></li>
</ul>
</li>
<li><a href="#sec-4">4 Using the nectar API</a>
<ul>
<li><a href="#sec-4-1">4.1 Adding a user</a></li>
<li><a href="#sec-4-2">4.2 Checking a user</a></li>
</ul>
</li>
<li><a href="#sec-5">5 Additional thoughts</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">


<p>
This project is an attempt to impement the Honeychecker from <a href="http://people.csail.mit.edu/rivest/honeywords/paper.pdf">the original honeywords paper</a>. The idea is simple. So simple in fact that
it took me a while to come to terms with just how simple it is. After
some thought and conversations with the authors I cam to the
conclusion that I needed to implement a complete version to stop
second guessing the premise.
</p>
<p>
The Honeychecker is just a small piece of the puzzle, but it is the
one component that can easily be (and should be) separated from the
primary login system. This document will serve as not only a write up
of the ideas, but a literate program. Emacs users can extract the
document into running code by invoking the <code>org-babel-tangle</code>
function.
</p>
<p>
This system is implemmented using the <a href="http://clojure.org">Clojure</a> language. Clojure is a
Lisp dialect that targets the JVM and JavaScript. To read more about
Clojure you can visit <a href="http://clojure.org">http://clojure.org</a> or purchase a copy of my
book, <a href="#LINK">Programming Clojure, 2nd Edition</a>.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Project definition and dependencies</h2>
<div class="outline-text-2" id="text-2">


<p>
We start by defining the project using <a href="#LINK">Leningen</a>. There are only a few
dependencies necessary to complete the implementation. First, we have
the Clojure language. Next, <a href="#LINK">Compojure</a>, a lightweight routing and web
server library. Since we are going to return data back to clients
using JSON, we will use <a href="#LINK">clojure.data.json</a>. Finally, we will be using
<a href="http://redis.io">Redis</a> as our data store, and the <a href="#LINK">Carmine</a> library provides that
functionality.
</p>
<p>
The entry labeled <code>:plugins</code> is used for developing the
application. <a href="#LINK">lein-ring</a> is a Leiningen plugin that allows for easy
application startup and dynamic code reloading. The <code>:ring</code> entry lets
<code>lein-ring</code> know where to find the application definintion so it can
boot the application.
</p>


<strong><i>project.clj</i></strong>

<pre class="src src-clojure">(<span style="color: #859900; font-weight: bold;">defproject</span> <span style="color: #268bd2;">nectar</span> <span style="color: #2aa198;">"0.1.0-SNAPSHOT"</span>
  <span style="color: #268bd2; font-weight: bold;">:description</span> <span style="color: #2aa198;">"A Honeycheker implementation"</span>
  <span style="color: #268bd2; font-weight: bold;">:url</span> <span style="color: #2aa198;">"https://github.com/abedra/nectar"</span>
  <span style="color: #268bd2; font-weight: bold;">:dependencies</span> [[org.clojure/clojure <span style="color: #2aa198;">"1.5.1"</span>]
                 [compojure <span style="color: #2aa198;">"1.1.6"</span>]
                 [org.clojure/data.json <span style="color: #2aa198;">"0.2.4"</span>]
                 [com.taoensso/carmine <span style="color: #2aa198;">"2.6.2"</span>]]
  <span style="color: #268bd2; font-weight: bold;">:plugins</span> [[lein-ring <span style="color: #2aa198;">"0.8.10"</span>]]
  <span style="color: #268bd2; font-weight: bold;">:ring</span> {<span style="color: #268bd2; font-weight: bold;">:handler</span> nectar.handler/app})
</pre>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Implementation</h2>
<div class="outline-text-2" id="text-3">



</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Loading resources</h3>
<div class="outline-text-3" id="text-3-1">


</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Setting up the Redis connection</h3>
<div class="outline-text-3" id="text-3-2">


</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> The add function</h3>
<div class="outline-text-3" id="text-3-3">


</div>

</div>

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> The check function</h3>
<div class="outline-text-3" id="text-3-4">


</div>

</div>

<div id="outline-container-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> Defining the application routes</h3>
<div class="outline-text-3" id="text-3-5">


</div>

</div>

<div id="outline-container-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> Defining the application</h3>
<div class="outline-text-3" id="text-3-6">


</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Using the nectar API</h2>
<div class="outline-text-2" id="text-4">



</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Adding a user</h3>
<div class="outline-text-3" id="text-4-1">


</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Checking a user</h3>
<div class="outline-text-3" id="text-4-2">


</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Additional thoughts</h2>
<div class="outline-text-2" id="text-5">


<p>
This is a simple implementation of a Honeychecker. There are
additional things that can and should be done to secure this
system. Callers of the Honeychecker should be verified. This could be
done by IP whitelist restrictions, authetication tokens, or any other
form of identification. This was intentionally left out of the sample
implementation in order to clearly demonstrate exactly what the
Honeychecker is and what it does.
</p></div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-05-12T16:40-0500</p>
<p class="author">Author: Aaron Bedra</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
